Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/nxp/mimxrt1160_evk/ssh_client_demo/keil/startup_mimxrt1166_cm7.s
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;Heap_Size       EQU     0x400

;                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp  ; Top of Stack
                DCD     Reset_Handler  ; Reset Handler
                DCD     NMI_Handler                         ;NMI Handler
                DCD     HardFault_Handler                   ;Hard Fault Handler
                DCD     MemManage_Handler                   ;MPU Fault Handler
                DCD     BusFault_Handler                    ;Bus Fault Handler
                DCD     UsageFault_Handler                  ;Usage Fault Handler
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     SVC_Handler                         ;SVCall Handler
                DCD     DebugMon_Handler                    ;Debug Monitor Handler
                DCD     0                                   ;Reserved
                DCD     PendSV_Handler                      ;PendSV Handler
                DCD     SysTick_Handler                     ;SysTick Handler

                ;External Interrupts
                DCD     DMA0_DMA16_IRQHandler               ;DMA channel 0/16 transfer complete
                DCD     DMA1_DMA17_IRQHandler               ;DMA channel 1/17 transfer complete
                DCD     DMA2_DMA18_IRQHandler               ;DMA channel 2/18 transfer complete
                DCD     DMA3_DMA19_IRQHandler               ;DMA channel 3/19 transfer complete
                DCD     DMA4_DMA20_IRQHandler               ;DMA channel 4/20 transfer complete
                DCD     DMA5_DMA21_IRQHandler               ;DMA channel 5/21 transfer complete
                DCD     DMA6_DMA22_IRQHandler               ;DMA channel 6/22 transfer complete
                DCD     DMA7_DMA23_IRQHandler               ;DMA channel 7/23 transfer complete
                DCD     DMA8_DMA24_IRQHandler               ;DMA channel 8/24 transfer complete
                DCD     DMA9_DMA25_IRQHandler               ;DMA channel 9/25 transfer complete
                DCD     DMA10_DMA26_IRQHandler              ;DMA channel 10/26 transfer complete
                DCD     DMA11_DMA27_IRQHandler              ;DMA channel 11/27 transfer complete
                DCD     DMA12_DMA28_IRQHandler              ;DMA channel 12/28 transfer complete
                DCD     DMA13_DMA29_IRQHandler              ;DMA channel 13/29 transfer complete
                DCD     DMA14_DMA30_IRQHandler              ;DMA channel 14/30 transfer complete
                DCD     DMA15_DMA31_IRQHandler              ;DMA channel 15/31 transfer complete
                DCD     DMA_ERROR_IRQHandler                ;DMA error interrupt channels 0-15 / 16-31
                DCD     CTI_TRIGGER_OUT0_IRQHandler         ;CTI_TRIGGER_OUT0
                DCD     CTI_TRIGGER_OUT1_IRQHandler         ;CTI_TRIGGER_OUT1
                DCD     CORE_IRQHandler                     ;CorePlatform exception IRQ
                DCD     LPUART1_IRQHandler                  ;LPUART1 TX interrupt and RX interrupt
                DCD     LPUART2_IRQHandler                  ;LPUART2 TX interrupt and RX interrupt
                DCD     LPUART3_IRQHandler                  ;LPUART3 TX interrupt and RX interrupt
                DCD     LPUART4_IRQHandler                  ;LPUART4 TX interrupt and RX interrupt
                DCD     LPUART5_IRQHandler                  ;LPUART5 TX interrupt and RX interrupt
                DCD     LPUART6_IRQHandler                  ;LPUART6 TX interrupt and RX interrupt
                DCD     LPUART7_IRQHandler                  ;LPUART7 TX interrupt and RX interrupt
                DCD     LPUART8_IRQHandler                  ;LPUART8 TX interrupt and RX interrupt
                DCD     LPUART9_IRQHandler                  ;LPUART9 TX interrupt and RX interrupt
                DCD     LPUART10_IRQHandler                 ;LPUART10 TX interrupt and RX interrupt
                DCD     LPUART11_IRQHandler                 ;LPUART11 TX interrupt and RX interrupt
                DCD     LPUART12_IRQHandler                 ;LPUART12 TX interrupt and RX interrupt
                DCD     LPI2C1_IRQHandler                   ;LPI2C1 interrupt
                DCD     LPI2C2_IRQHandler                   ;LPI2C2 interrupt
                DCD     LPI2C3_IRQHandler                   ;LPI2C3 interrupt
                DCD     LPI2C4_IRQHandler                   ;LPI2C4 interrupt
                DCD     LPI2C5_IRQHandler                   ;LPI2C5 interrupt
                DCD     LPI2C6_IRQHandler                   ;LPI2C6 interrupt
                DCD     LPSPI1_IRQHandler                   ;LPSPI1 interrupt request line to the core
                DCD     LPSPI2_IRQHandler                   ;LPSPI2 interrupt request line to the core
                DCD     LPSPI3_IRQHandler                   ;LPSPI3 interrupt request line to the core
                DCD     LPSPI4_IRQHandler                   ;LPSPI4 interrupt request line to the core
                DCD     LPSPI5_IRQHandler                   ;LPSPI5 interrupt request line to the core
                DCD     LPSPI6_IRQHandler                   ;LPSPI6 interrupt request line to the core
                DCD     CAN1_IRQHandler                     ;CAN1 interrupt
                DCD     CAN1_ERROR_IRQHandler               ;CAN1 error interrupt
                DCD     CAN2_IRQHandler                     ;CAN2 interrupt
                DCD     CAN2_ERROR_IRQHandler               ;CAN2 error interrupt
                DCD     CAN3_IRQHandler                     ;CAN3 interrupt
                DCD     CAN3_ERROR_IRQHandler               ;CAN3 erro interrupt
                DCD     FLEXRAM_IRQHandler                  ;FlexRAM address out of range Or access hit IRQ
                DCD     KPP_IRQHandler                      ;Keypad nterrupt
                DCD     Reserved68_IRQHandler               ;Reserved interrupt
                DCD     GPR_IRQ_IRQHandler                  ;GPR interrupt
                DCD     eLCDIF_IRQHandler                   ;eLCDIF interrupt
                DCD     LCDIFv2_IRQHandler                  ;LCDIFv2 interrupt
                DCD     CSI_IRQHandler                      ;CSI interrupt
                DCD     PXP_IRQHandler                      ;PXP interrupt
                DCD     MIPI_CSI_IRQHandler                 ;MIPI_CSI interrupt
                DCD     MIPI_DSI_IRQHandler                 ;MIPI_DSI interrupt
                DCD     GPU2D_IRQHandler                    ;GPU2D interrupt
                DCD     GPIO6_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO6 signal 0 throughout 15
                DCD     GPIO6_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO6 signal 16 throughout 31
                DCD     DAC_IRQHandler                      ;DAC interrupt
                DCD     KEY_MANAGER_IRQHandler              ;PUF interrupt
                DCD     WDOG2_IRQHandler                    ;WDOG2 interrupt
                DCD     SNVS_HP_NON_TZ_IRQHandler           ;SRTC Consolidated Interrupt. Non TZ
                DCD     SNVS_HP_TZ_IRQHandler               ;SRTC Security Interrupt. TZ
                DCD     SNVS_PULSE_EVENT_IRQHandler         ;ON-OFF button press shorter than 5 secs (pulse event)
                DCD     CAAM_IRQ0_IRQHandler                ;CAAM interrupt queue for JQ0
                DCD     CAAM_IRQ1_IRQHandler                ;CAAM interrupt queue for JQ1
                DCD     CAAM_IRQ2_IRQHandler                ;CAAM interrupt queue for JQ2
                DCD     CAAM_IRQ3_IRQHandler                ;CAAM interrupt queue for JQ3
                DCD     CAAM_RECORVE_ERRPR_IRQHandler       ;CAAM interrupt for recoverable error
                DCD     CAAM_RTIC_IRQHandler                ;CAAM interrupt for RTIC
                DCD     CDOG_IRQHandler                     ;CDOG interrupt
                DCD     SAI1_IRQHandler                     ;SAI1 interrupt
                DCD     SAI2_IRQHandler                     ;SAI1 interrupt
                DCD     SAI3_RX_IRQHandler                  ;SAI3 interrupt
                DCD     SAI3_TX_IRQHandler                  ;SAI3 interrupt
                DCD     SAI4_RX_IRQHandler                  ;SAI4 interrupt
                DCD     SAI4_TX_IRQHandler                  ;SAI4 interrupt
                DCD     SPDIF_IRQHandler                    ;SPDIF interrupt
                DCD     TMPSNS_INT_IRQHandler               ;TMPSNS interrupt
                DCD     TMPSNS_LOW_HIGH_IRQHandler          ;TMPSNS low high interrupt
                DCD     TMPSNS_PANIC_IRQHandler             ;TMPSNS panic interrupt
                DCD     LPSR_LP8_BROWNOUT_IRQHandler        ;LPSR 1p8 brownout interrupt
                DCD     LPSR_LP0_BROWNOUT_IRQHandler        ;LPSR 1p0 brownout interrupt
                DCD     ADC1_IRQHandler                     ;ADC1 interrupt
                DCD     ADC2_IRQHandler                     ;ADC2 interrupt
                DCD     USBPHY1_IRQHandler                  ;USBPHY1 interrupt
                DCD     USBPHY2_IRQHandler                  ;USBPHY2 interrupt
                DCD     RDC_IRQHandler                      ;RDC interrupt
                DCD     GPIO13_Combined_0_31_IRQHandler     ;Combined interrupt indication for GPIO13 signal 0 throughout 31
                DCD     Reserved110_IRQHandler              ;Reserved interrupt
                DCD     DCIC1_IRQHandler                    ;DCIC1 interrupt
                DCD     DCIC2_IRQHandler                    ;DCIC2 interrupt
                DCD     ASRC_IRQHandler                     ;ASRC interrupt
                DCD     FLEXRAM_ECC_IRQHandler              ;FlexRAM ECC fatal interrupt
                DCD     CM7_GPIO2_3_IRQHandler              ;CM7_GPIO2,CM7_GPIO3 interrupt
                DCD     GPIO1_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO1 signal 0 throughout 15
                DCD     GPIO1_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO1 signal 16 throughout 31
                DCD     GPIO2_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO2 signal 0 throughout 15
                DCD     GPIO2_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO2 signal 16 throughout 31
                DCD     GPIO3_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO3 signal 0 throughout 15
                DCD     GPIO3_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO3 signal 16 throughout 31
                DCD     GPIO4_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO4 signal 0 throughout 15
                DCD     GPIO4_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO4 signal 16 throughout 31
                DCD     GPIO5_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO5 signal 0 throughout 15
                DCD     GPIO5_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO5 signal 16 throughout 31
                DCD     FLEXIO1_IRQHandler                  ;FLEXIO1 interrupt
                DCD     FLEXIO2_IRQHandler                  ;FLEXIO2 interrupt
                DCD     WDOG1_IRQHandler                    ;WDOG1 interrupt
                DCD     RTWDOG3_IRQHandler                  ;RTWDOG3 interrupt
                DCD     EWM_IRQHandler                      ;EWM interrupt
                DCD     OCOTP_READ_FUSE_ERROR_IRQHandler    ;OCOTP read fuse error interrupt
                DCD     OCOTP_READ_DONE_ERROR_IRQHandler    ;OCOTP read fuse done interrupt
                DCD     GPC_IRQHandler                      ;GPC interrupt
                DCD     MUA_IRQHandler                      ;MUA interrupt
                DCD     GPT1_IRQHandler                     ;GPT1 interrupt
                DCD     GPT2_IRQHandler                     ;GPT2 interrupt
                DCD     GPT3_IRQHandler                     ;GPT3 interrupt
                DCD     GPT4_IRQHandler                     ;GPT4 interrupt
                DCD     GPT5_IRQHandler                     ;GPT5 interrupt
                DCD     GPT6_IRQHandler                     ;GPT6 interrupt
                DCD     PWM1_0_IRQHandler                   ;PWM1 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM1_1_IRQHandler                   ;PWM1 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM1_2_IRQHandler                   ;PWM1 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM1_3_IRQHandler                   ;PWM1 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM1_FAULT_IRQHandler               ;PWM1 fault or reload error interrupt
                DCD     FLEXSPI1_IRQHandler                 ;FlexSPI1 interrupt
                DCD     FLEXSPI2_IRQHandler                 ;FlexSPI2 interrupt
                DCD     SEMC_IRQHandler                     ;SEMC interrupt
                DCD     USDHC1_IRQHandler                   ;USDHC1 interrupt
                DCD     USDHC2_IRQHandler                   ;USDHC2 interrupt
                DCD     USB_OTG2_IRQHandler                 ;USBO2 USB OTG2
                DCD     USB_OTG1_IRQHandler                 ;USBO2 USB OTG1
                DCD     ENET_IRQHandler                     ;ENET interrupt
                DCD     ENET_1588_Timer_IRQHandler          ;ENET_1588_Timer interrupt
                DCD     ENET_1G_MAC0_Tx_Rx_1_IRQHandler     ;ENET 1G MAC0 transmit/receive 1
                DCD     ENET_1G_MAC0_Tx_Rx_2_IRQHandler     ;ENET 1G MAC0 transmit/receive 2
                DCD     ENET_1G_IRQHandler                  ;ENET 1G interrupt
                DCD     ENET_1G_1588_Timer_IRQHandler       ;ENET_1G_1588_Timer interrupt
                DCD     XBAR1_IRQ_0_1_IRQHandler            ;XBAR1 interrupt
                DCD     XBAR1_IRQ_2_3_IRQHandler            ;XBAR1 interrupt
                DCD     ADC_ETC_IRQ0_IRQHandler             ;ADCETC IRQ0 interrupt
                DCD     ADC_ETC_IRQ1_IRQHandler             ;ADCETC IRQ1 interrupt
                DCD     ADC_ETC_IRQ2_IRQHandler             ;ADCETC IRQ2 interrupt
                DCD     ADC_ETC_IRQ3_IRQHandler             ;ADCETC IRQ3 interrupt
                DCD     ADC_ETC_ERROR_IRQ_IRQHandler        ;ADCETC Error IRQ interrupt
                DCD     Reserved166_IRQHandler              ;Reserved interrupt
                DCD     Reserved167_IRQHandler              ;Reserved interrupt
                DCD     Reserved168_IRQHandler              ;Reserved interrupt
                DCD     Reserved169_IRQHandler              ;Reserved interrupt
                DCD     Reserved170_IRQHandler              ;Reserved interrupt
                DCD     PIT1_IRQHandler                     ;PIT1 interrupt
                DCD     PIT2_IRQHandler                     ;PIT2 interrupt
                DCD     ACMP1_IRQHandler                    ;ACMP interrupt
                DCD     ACMP2_IRQHandler                    ;ACMP interrupt
                DCD     ACMP3_IRQHandler                    ;ACMP interrupt
                DCD     ACMP4_IRQHandler                    ;ACMP interrupt
                DCD     Reserved177_IRQHandler              ;Reserved interrupt
                DCD     Reserved178_IRQHandler              ;Reserved interrupt
                DCD     Reserved179_IRQHandler              ;Reserved interrupt
                DCD     Reserved180_IRQHandler              ;Reserved interrupt
                DCD     ENC1_IRQHandler                     ;ENC1 interrupt
                DCD     ENC2_IRQHandler                     ;ENC2 interrupt
                DCD     ENC3_IRQHandler                     ;ENC3 interrupt
                DCD     ENC4_IRQHandler                     ;ENC4 interrupt
                DCD     Reserved185_IRQHandler              ;Reserved interrupt
                DCD     Reserved186_IRQHandler              ;Reserved interrupt
                DCD     TMR1_IRQHandler                     ;TMR1 interrupt
                DCD     TMR2_IRQHandler                     ;TMR2 interrupt
                DCD     TMR3_IRQHandler                     ;TMR3 interrupt
                DCD     TMR4_IRQHandler                     ;TMR4 interrupt
                DCD     SEMA4_CP0_IRQHandler                ;SEMA4 CP0 interrupt
                DCD     SEMA4_CP1_IRQHandler                ;SEMA4 CP1 interrupt
                DCD     PWM2_0_IRQHandler                   ;PWM2 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM2_1_IRQHandler                   ;PWM2 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM2_2_IRQHandler                   ;PWM2 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM2_3_IRQHandler                   ;PWM2 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM2_FAULT_IRQHandler               ;PWM2 fault or reload error interrupt
                DCD     PWM3_0_IRQHandler                   ;PWM3 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM3_1_IRQHandler                   ;PWM3 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM3_2_IRQHandler                   ;PWM3 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM3_3_IRQHandler                   ;PWM3 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM3_FAULT_IRQHandler               ;PWM3 fault or reload error interrupt
                DCD     PWM4_0_IRQHandler                   ;PWM4 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM4_1_IRQHandler                   ;PWM4 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM4_2_IRQHandler                   ;PWM4 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM4_3_IRQHandler                   ;PWM4 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM4_FAULT_IRQHandler               ;PWM4 fault or reload error interrupt
                DCD     Reserved208_IRQHandler              ;Reserved interrupt
                DCD     Reserved209_IRQHandler              ;Reserved interrupt
                DCD     Reserved210_IRQHandler              ;Reserved interrupt
                DCD     Reserved211_IRQHandler              ;Reserved interrupt
                DCD     Reserved212_IRQHandler              ;Reserved interrupt
                DCD     Reserved213_IRQHandler              ;Reserved interrupt
                DCD     Reserved214_IRQHandler              ;Reserved interrupt
                DCD     Reserved215_IRQHandler              ;Reserved interrupt
                DCD     HWVAD_EVENT_IRQHandler              ;HWVAD event interrupt
                DCD     HWVAD_ERROR_IRQHandler              ;HWVAD error interrupt
                DCD     PDM_EVENT_IRQHandler                ;PDM event interrupt
                DCD     PDM_ERROR_IRQHandler                ;PDM error interrupt
                DCD     EMVSIM1_IRQHandler                  ;EMVSIM1 interrupt
                DCD     EMVSIM2_IRQHandler                  ;EMVSIM2 interrupt
                DCD     MECC1_INT_IRQHandler                ;MECC1 int
                DCD     MECC1_FATAL_INT_IRQHandler          ;MECC1 fatal int
                DCD     MECC2_INT_IRQHandler                ;MECC2 int
                DCD     MECC2_FATAL_INT_IRQHandler          ;MECC2 fatal int
                DCD     XECC_FLEXSPI1_INT_IRQHandler        ;XECC int
                DCD     XECC_FLEXSPI1_FATAL_INT_IRQHandler  ;XECC fatal int
                DCD     XECC_FLEXSPI2_INT_IRQHandler        ;XECC int
                DCD     XECC_FLEXSPI2_FATAL_INT_IRQHandler  ;XECC fatal int
                DCD     XECC_SEMC_INT_IRQHandler            ;XECC int
                DCD     XECC_SEMC_FATAL_INT_IRQHandler      ;XECC fatal int
                DCD     Reserved232_IRQHandler              ;Reserved interrupt
                DCD     Reserved233_IRQHandler              ;Reserved interrupt
                DCD     DefaultISR                          ;234
                DCD     DefaultISR                          ;235
                DCD     DefaultISR                          ;236
                DCD     DefaultISR                          ;237
                DCD     DefaultISR                          ;238
                DCD     DefaultISR                          ;239
                DCD     DefaultISR                          ;240
                DCD     DefaultISR                          ;241
                DCD     DefaultISR                          ;242
                DCD     DefaultISR                          ;243
                DCD     DefaultISR                          ;244
                DCD     DefaultISR                          ;245
                DCD     DefaultISR                          ;246
                DCD     DefaultISR                          ;247
                DCD     DefaultISR                          ;248
                DCD     DefaultISR                          ;249
                DCD     DefaultISR                          ;250
                DCD     DefaultISR                          ;251
                DCD     DefaultISR                          ;252
                DCD     DefaultISR                          ;253
                DCD     DefaultISR                          ;254
                DCD     0xFFFFFFFF                          ; Reserved for user TRIM value
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

