Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/nxp/mimxrt1160_evk/ssh_client_demo/keil/startup_mimxrt1166_cm7.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler                       [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                CPSID   I               ; Mask interrupts
                LDR     R0, =0xE000ED08
                LDR     R1, =__Vectors
                STR     R1, [R0]
                LDR     R2, [R1]
                MSR     MSP, R2
                LDR     R0, =SystemInit
                BLX     R0
                CPSIE   i               ; Unmask interrupts
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)
NMI_Handler\
                PROC
                EXPORT  NMI_Handler                         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                   [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                   [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                    [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                  [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler                         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                    [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler                      [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler                     [WEAK]
                B       .
                ENDP

Default_Handler\
                PROC
                EXPORT  DMA0_DMA16_IRQHandler               [WEAK]
                EXPORT  DMA1_DMA17_IRQHandler               [WEAK]
                EXPORT  DMA2_DMA18_IRQHandler               [WEAK]
                EXPORT  DMA3_DMA19_IRQHandler               [WEAK]
                EXPORT  DMA4_DMA20_IRQHandler               [WEAK]
                EXPORT  DMA5_DMA21_IRQHandler               [WEAK]
                EXPORT  DMA6_DMA22_IRQHandler               [WEAK]
                EXPORT  DMA7_DMA23_IRQHandler               [WEAK]
                EXPORT  DMA8_DMA24_IRQHandler               [WEAK]
                EXPORT  DMA9_DMA25_IRQHandler               [WEAK]
                EXPORT  DMA10_DMA26_IRQHandler              [WEAK]
                EXPORT  DMA11_DMA27_IRQHandler              [WEAK]
                EXPORT  DMA12_DMA28_IRQHandler              [WEAK]
                EXPORT  DMA13_DMA29_IRQHandler              [WEAK]
                EXPORT  DMA14_DMA30_IRQHandler              [WEAK]
                EXPORT  DMA15_DMA31_IRQHandler              [WEAK]
                EXPORT  DMA_ERROR_IRQHandler                [WEAK]
                EXPORT  CTI_TRIGGER_OUT0_IRQHandler         [WEAK]
                EXPORT  CTI_TRIGGER_OUT1_IRQHandler         [WEAK]
                EXPORT  CORE_IRQHandler                     [WEAK]
                EXPORT  LPUART1_IRQHandler                  [WEAK]
                EXPORT  LPUART2_IRQHandler                  [WEAK]
                EXPORT  LPUART3_IRQHandler                  [WEAK]
                EXPORT  LPUART4_IRQHandler                  [WEAK]
                EXPORT  LPUART5_IRQHandler                  [WEAK]
                EXPORT  LPUART6_IRQHandler                  [WEAK]
                EXPORT  LPUART7_IRQHandler                  [WEAK]
                EXPORT  LPUART8_IRQHandler                  [WEAK]
                EXPORT  LPUART9_IRQHandler                  [WEAK]
                EXPORT  LPUART10_IRQHandler                 [WEAK]
                EXPORT  LPUART11_IRQHandler                 [WEAK]
                EXPORT  LPUART12_IRQHandler                 [WEAK]
                EXPORT  LPI2C1_IRQHandler                   [WEAK]
                EXPORT  LPI2C2_IRQHandler                   [WEAK]
                EXPORT  LPI2C3_IRQHandler                   [WEAK]
                EXPORT  LPI2C4_IRQHandler                   [WEAK]
                EXPORT  LPI2C5_IRQHandler                   [WEAK]
                EXPORT  LPI2C6_IRQHandler                   [WEAK]
                EXPORT  LPSPI1_IRQHandler                   [WEAK]
                EXPORT  LPSPI2_IRQHandler                   [WEAK]
                EXPORT  LPSPI3_IRQHandler                   [WEAK]
                EXPORT  LPSPI4_IRQHandler                   [WEAK]
                EXPORT  LPSPI5_IRQHandler                   [WEAK]
                EXPORT  LPSPI6_IRQHandler                   [WEAK]
                EXPORT  CAN1_IRQHandler                     [WEAK]
                EXPORT  CAN1_ERROR_IRQHandler               [WEAK]
                EXPORT  CAN2_IRQHandler                     [WEAK]
                EXPORT  CAN2_ERROR_IRQHandler               [WEAK]
                EXPORT  CAN3_IRQHandler                     [WEAK]
                EXPORT  CAN3_ERROR_IRQHandler               [WEAK]
                EXPORT  FLEXRAM_IRQHandler                  [WEAK]
                EXPORT  KPP_IRQHandler                      [WEAK]
                EXPORT  Reserved68_IRQHandler               [WEAK]
                EXPORT  GPR_IRQ_IRQHandler                  [WEAK]
                EXPORT  eLCDIF_IRQHandler                   [WEAK]
                EXPORT  LCDIFv2_IRQHandler                  [WEAK]
                EXPORT  CSI_IRQHandler                      [WEAK]
                EXPORT  PXP_IRQHandler                      [WEAK]
                EXPORT  MIPI_CSI_IRQHandler                 [WEAK]
                EXPORT  MIPI_DSI_IRQHandler                 [WEAK]
                EXPORT  GPU2D_IRQHandler                    [WEAK]
                EXPORT  GPIO6_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO6_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  DAC_IRQHandler                      [WEAK]
                EXPORT  KEY_MANAGER_IRQHandler              [WEAK]
                EXPORT  WDOG2_IRQHandler                    [WEAK]
                EXPORT  SNVS_HP_NON_TZ_IRQHandler           [WEAK]
                EXPORT  SNVS_HP_TZ_IRQHandler               [WEAK]
                EXPORT  SNVS_PULSE_EVENT_IRQHandler         [WEAK]
                EXPORT  CAAM_IRQ0_IRQHandler                [WEAK]
                EXPORT  CAAM_IRQ1_IRQHandler                [WEAK]
                EXPORT  CAAM_IRQ2_IRQHandler                [WEAK]
                EXPORT  CAAM_IRQ3_IRQHandler                [WEAK]
                EXPORT  CAAM_RECORVE_ERRPR_IRQHandler       [WEAK]
                EXPORT  CAAM_RTIC_IRQHandler                [WEAK]
                EXPORT  CDOG_IRQHandler                     [WEAK]
                EXPORT  SAI1_IRQHandler                     [WEAK]
                EXPORT  SAI2_IRQHandler                     [WEAK]
                EXPORT  SAI3_RX_IRQHandler                  [WEAK]
                EXPORT  SAI3_TX_IRQHandler                  [WEAK]
                EXPORT  SAI4_RX_IRQHandler                  [WEAK]
                EXPORT  SAI4_TX_IRQHandler                  [WEAK]
                EXPORT  SPDIF_IRQHandler                    [WEAK]
                EXPORT  TMPSNS_INT_IRQHandler               [WEAK]
                EXPORT  TMPSNS_LOW_HIGH_IRQHandler          [WEAK]
                EXPORT  TMPSNS_PANIC_IRQHandler             [WEAK]
                EXPORT  LPSR_LP8_BROWNOUT_IRQHandler        [WEAK]
                EXPORT  LPSR_LP0_BROWNOUT_IRQHandler        [WEAK]
                EXPORT  ADC1_IRQHandler                     [WEAK]
                EXPORT  ADC2_IRQHandler                     [WEAK]
                EXPORT  USBPHY1_IRQHandler                  [WEAK]
                EXPORT  USBPHY2_IRQHandler                  [WEAK]
                EXPORT  RDC_IRQHandler                      [WEAK]
                EXPORT  GPIO13_Combined_0_31_IRQHandler     [WEAK]
                EXPORT  Reserved110_IRQHandler              [WEAK]
                EXPORT  DCIC1_IRQHandler                    [WEAK]
                EXPORT  DCIC2_IRQHandler                    [WEAK]
                EXPORT  ASRC_IRQHandler                     [WEAK]
                EXPORT  FLEXRAM_ECC_IRQHandler              [WEAK]
                EXPORT  CM7_GPIO2_3_IRQHandler              [WEAK]
                EXPORT  GPIO1_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO1_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO2_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO2_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO3_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO3_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO4_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO4_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO5_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO5_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  FLEXIO1_IRQHandler                  [WEAK]
                EXPORT  FLEXIO2_IRQHandler                  [WEAK]
                EXPORT  WDOG1_IRQHandler                    [WEAK]
                EXPORT  RTWDOG3_IRQHandler                  [WEAK]
                EXPORT  EWM_IRQHandler                      [WEAK]
                EXPORT  OCOTP_READ_FUSE_ERROR_IRQHandler    [WEAK]
                EXPORT  OCOTP_READ_DONE_ERROR_IRQHandler    [WEAK]
                EXPORT  GPC_IRQHandler                      [WEAK]
                EXPORT  MUA_IRQHandler                      [WEAK]
                EXPORT  GPT1_IRQHandler                     [WEAK]
                EXPORT  GPT2_IRQHandler                     [WEAK]
                EXPORT  GPT3_IRQHandler                     [WEAK]
                EXPORT  GPT4_IRQHandler                     [WEAK]
                EXPORT  GPT5_IRQHandler                     [WEAK]
                EXPORT  GPT6_IRQHandler                     [WEAK]
                EXPORT  PWM1_0_IRQHandler                   [WEAK]
                EXPORT  PWM1_1_IRQHandler                   [WEAK]
                EXPORT  PWM1_2_IRQHandler                   [WEAK]
                EXPORT  PWM1_3_IRQHandler                   [WEAK]
                EXPORT  PWM1_FAULT_IRQHandler               [WEAK]
                EXPORT  FLEXSPI1_IRQHandler                 [WEAK]
                EXPORT  FLEXSPI2_IRQHandler                 [WEAK]
                EXPORT  SEMC_IRQHandler                     [WEAK]
                EXPORT  USDHC1_IRQHandler                   [WEAK]
                EXPORT  USDHC2_IRQHandler                   [WEAK]
                EXPORT  USB_OTG2_IRQHandler                 [WEAK]
                EXPORT  USB_OTG1_IRQHandler                 [WEAK]
                EXPORT  ENET_IRQHandler                     [WEAK]
                EXPORT  ENET_1588_Timer_IRQHandler          [WEAK]
                EXPORT  ENET_1G_MAC0_Tx_Rx_1_IRQHandler     [WEAK]
                EXPORT  ENET_1G_MAC0_Tx_Rx_2_IRQHandler     [WEAK]
                EXPORT  ENET_1G_IRQHandler                  [WEAK]
                EXPORT  ENET_1G_1588_Timer_IRQHandler       [WEAK]
                EXPORT  XBAR1_IRQ_0_1_IRQHandler            [WEAK]
                EXPORT  XBAR1_IRQ_2_3_IRQHandler            [WEAK]
                EXPORT  ADC_ETC_IRQ0_IRQHandler             [WEAK]
                EXPORT  ADC_ETC_IRQ1_IRQHandler             [WEAK]
                EXPORT  ADC_ETC_IRQ2_IRQHandler             [WEAK]
                EXPORT  ADC_ETC_IRQ3_IRQHandler             [WEAK]
                EXPORT  ADC_ETC_ERROR_IRQ_IRQHandler        [WEAK]
                EXPORT  Reserved166_IRQHandler              [WEAK]
                EXPORT  Reserved167_IRQHandler              [WEAK]
                EXPORT  Reserved168_IRQHandler              [WEAK]
                EXPORT  Reserved169_IRQHandler              [WEAK]
                EXPORT  Reserved170_IRQHandler              [WEAK]
                EXPORT  PIT1_IRQHandler                     [WEAK]
                EXPORT  PIT2_IRQHandler                     [WEAK]
                EXPORT  ACMP1_IRQHandler                    [WEAK]
                EXPORT  ACMP2_IRQHandler                    [WEAK]
                EXPORT  ACMP3_IRQHandler                    [WEAK]
                EXPORT  ACMP4_IRQHandler                    [WEAK]
                EXPORT  Reserved177_IRQHandler              [WEAK]
                EXPORT  Reserved178_IRQHandler              [WEAK]
                EXPORT  Reserved179_IRQHandler              [WEAK]
                EXPORT  Reserved180_IRQHandler              [WEAK]
                EXPORT  ENC1_IRQHandler                     [WEAK]
                EXPORT  ENC2_IRQHandler                     [WEAK]
                EXPORT  ENC3_IRQHandler                     [WEAK]
                EXPORT  ENC4_IRQHandler                     [WEAK]
                EXPORT  Reserved185_IRQHandler              [WEAK]
                EXPORT  Reserved186_IRQHandler              [WEAK]
                EXPORT  TMR1_IRQHandler                     [WEAK]
                EXPORT  TMR2_IRQHandler                     [WEAK]
                EXPORT  TMR3_IRQHandler                     [WEAK]
                EXPORT  TMR4_IRQHandler                     [WEAK]
                EXPORT  SEMA4_CP0_IRQHandler                [WEAK]
                EXPORT  SEMA4_CP1_IRQHandler                [WEAK]
                EXPORT  PWM2_0_IRQHandler                   [WEAK]
                EXPORT  PWM2_1_IRQHandler                   [WEAK]
                EXPORT  PWM2_2_IRQHandler                   [WEAK]
                EXPORT  PWM2_3_IRQHandler                   [WEAK]
                EXPORT  PWM2_FAULT_IRQHandler               [WEAK]
                EXPORT  PWM3_0_IRQHandler                   [WEAK]
                EXPORT  PWM3_1_IRQHandler                   [WEAK]
                EXPORT  PWM3_2_IRQHandler                   [WEAK]
                EXPORT  PWM3_3_IRQHandler                   [WEAK]
                EXPORT  PWM3_FAULT_IRQHandler               [WEAK]
                EXPORT  PWM4_0_IRQHandler                   [WEAK]
                EXPORT  PWM4_1_IRQHandler                   [WEAK]
                EXPORT  PWM4_2_IRQHandler                   [WEAK]
                EXPORT  PWM4_3_IRQHandler                   [WEAK]
                EXPORT  PWM4_FAULT_IRQHandler               [WEAK]
                EXPORT  Reserved208_IRQHandler              [WEAK]
                EXPORT  Reserved209_IRQHandler              [WEAK]
                EXPORT  Reserved210_IRQHandler              [WEAK]
                EXPORT  Reserved211_IRQHandler              [WEAK]
                EXPORT  Reserved212_IRQHandler              [WEAK]
                EXPORT  Reserved213_IRQHandler              [WEAK]
                EXPORT  Reserved214_IRQHandler              [WEAK]
                EXPORT  Reserved215_IRQHandler              [WEAK]
                EXPORT  HWVAD_EVENT_IRQHandler              [WEAK]
                EXPORT  HWVAD_ERROR_IRQHandler              [WEAK]
                EXPORT  PDM_EVENT_IRQHandler                [WEAK]
                EXPORT  PDM_ERROR_IRQHandler                [WEAK]
                EXPORT  EMVSIM1_IRQHandler                  [WEAK]
                EXPORT  EMVSIM2_IRQHandler                  [WEAK]
                EXPORT  MECC1_INT_IRQHandler                [WEAK]
                EXPORT  MECC1_FATAL_INT_IRQHandler          [WEAK]
                EXPORT  MECC2_INT_IRQHandler                [WEAK]
                EXPORT  MECC2_FATAL_INT_IRQHandler          [WEAK]
                EXPORT  XECC_FLEXSPI1_INT_IRQHandler        [WEAK]
                EXPORT  XECC_FLEXSPI1_FATAL_INT_IRQHandler  [WEAK]
                EXPORT  XECC_FLEXSPI2_INT_IRQHandler        [WEAK]
                EXPORT  XECC_FLEXSPI2_FATAL_INT_IRQHandler  [WEAK]
                EXPORT  XECC_SEMC_INT_IRQHandler            [WEAK]
                EXPORT  XECC_SEMC_FATAL_INT_IRQHandler      [WEAK]
                EXPORT  Reserved232_IRQHandler              [WEAK]
                EXPORT  Reserved233_IRQHandler              [WEAK]
                EXPORT  DefaultISR                          [WEAK]
DMA0_DMA16_IRQHandler
DMA1_DMA17_IRQHandler
DMA2_DMA18_IRQHandler
DMA3_DMA19_IRQHandler
DMA4_DMA20_IRQHandler
DMA5_DMA21_IRQHandler
DMA6_DMA22_IRQHandler
DMA7_DMA23_IRQHandler
DMA8_DMA24_IRQHandler
DMA9_DMA25_IRQHandler
DMA10_DMA26_IRQHandler
DMA11_DMA27_IRQHandler
DMA12_DMA28_IRQHandler
DMA13_DMA29_IRQHandler
DMA14_DMA30_IRQHandler
DMA15_DMA31_IRQHandler
DMA_ERROR_IRQHandler
CTI_TRIGGER_OUT0_IRQHandler
CTI_TRIGGER_OUT1_IRQHandler
CORE_IRQHandler
LPUART1_IRQHandler
LPUART2_IRQHandler
LPUART3_IRQHandler
LPUART4_IRQHandler
LPUART5_IRQHandler
LPUART6_IRQHandler
LPUART7_IRQHandler
LPUART8_IRQHandler
LPUART9_IRQHandler
LPUART10_IRQHandler
LPUART11_IRQHandler
LPUART12_IRQHandler
LPI2C1_IRQHandler
LPI2C2_IRQHandler
LPI2C3_IRQHandler
LPI2C4_IRQHandler
LPI2C5_IRQHandler
LPI2C6_IRQHandler
LPSPI1_IRQHandler
LPSPI2_IRQHandler
LPSPI3_IRQHandler
LPSPI4_IRQHandler
LPSPI5_IRQHandler
LPSPI6_IRQHandler
CAN1_IRQHandler
CAN1_ERROR_IRQHandler
CAN2_IRQHandler
CAN2_ERROR_IRQHandler
CAN3_IRQHandler
CAN3_ERROR_IRQHandler
FLEXRAM_IRQHandler
KPP_IRQHandler
Reserved68_IRQHandler
GPR_IRQ_IRQHandler
eLCDIF_IRQHandler
LCDIFv2_IRQHandler
CSI_IRQHandler
PXP_IRQHandler
MIPI_CSI_IRQHandler
MIPI_DSI_IRQHandler
GPU2D_IRQHandler
GPIO6_Combined_0_15_IRQHandler
GPIO6_Combined_16_31_IRQHandler
DAC_IRQHandler
KEY_MANAGER_IRQHandler
WDOG2_IRQHandler
SNVS_HP_NON_TZ_IRQHandler
SNVS_HP_TZ_IRQHandler
SNVS_PULSE_EVENT_IRQHandler
CAAM_IRQ0_IRQHandler
CAAM_IRQ1_IRQHandler
CAAM_IRQ2_IRQHandler
CAAM_IRQ3_IRQHandler
CAAM_RECORVE_ERRPR_IRQHandler
CAAM_RTIC_IRQHandler
CDOG_IRQHandler
SAI1_IRQHandler
SAI2_IRQHandler
SAI3_RX_IRQHandler
SAI3_TX_IRQHandler
SAI4_RX_IRQHandler
SAI4_TX_IRQHandler
SPDIF_IRQHandler
TMPSNS_INT_IRQHandler
TMPSNS_LOW_HIGH_IRQHandler
TMPSNS_PANIC_IRQHandler
LPSR_LP8_BROWNOUT_IRQHandler
LPSR_LP0_BROWNOUT_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
USBPHY1_IRQHandler
USBPHY2_IRQHandler
RDC_IRQHandler
GPIO13_Combined_0_31_IRQHandler
Reserved110_IRQHandler
DCIC1_IRQHandler
DCIC2_IRQHandler
ASRC_IRQHandler
FLEXRAM_ECC_IRQHandler
CM7_GPIO2_3_IRQHandler
GPIO1_Combined_0_15_IRQHandler
GPIO1_Combined_16_31_IRQHandler
GPIO2_Combined_0_15_IRQHandler
GPIO2_Combined_16_31_IRQHandler
GPIO3_Combined_0_15_IRQHandler
GPIO3_Combined_16_31_IRQHandler
GPIO4_Combined_0_15_IRQHandler
GPIO4_Combined_16_31_IRQHandler
GPIO5_Combined_0_15_IRQHandler
GPIO5_Combined_16_31_IRQHandler
FLEXIO1_IRQHandler
FLEXIO2_IRQHandler
WDOG1_IRQHandler
RTWDOG3_IRQHandler
EWM_IRQHandler
OCOTP_READ_FUSE_ERROR_IRQHandler
OCOTP_READ_DONE_ERROR_IRQHandler
GPC_IRQHandler
MUA_IRQHandler
GPT1_IRQHandler
GPT2_IRQHandler
GPT3_IRQHandler
GPT4_IRQHandler
GPT5_IRQHandler
GPT6_IRQHandler
PWM1_0_IRQHandler
PWM1_1_IRQHandler
PWM1_2_IRQHandler
PWM1_3_IRQHandler
PWM1_FAULT_IRQHandler
FLEXSPI1_IRQHandler
FLEXSPI2_IRQHandler
SEMC_IRQHandler
USDHC1_IRQHandler
USDHC2_IRQHandler
USB_OTG2_IRQHandler
USB_OTG1_IRQHandler
ENET_IRQHandler
ENET_1588_Timer_IRQHandler
ENET_1G_MAC0_Tx_Rx_1_IRQHandler
ENET_1G_MAC0_Tx_Rx_2_IRQHandler
ENET_1G_IRQHandler
ENET_1G_1588_Timer_IRQHandler
XBAR1_IRQ_0_1_IRQHandler
XBAR1_IRQ_2_3_IRQHandler
ADC_ETC_IRQ0_IRQHandler
ADC_ETC_IRQ1_IRQHandler
ADC_ETC_IRQ2_IRQHandler
ADC_ETC_IRQ3_IRQHandler
ADC_ETC_ERROR_IRQ_IRQHandler
Reserved166_IRQHandler
Reserved167_IRQHandler
Reserved168_IRQHandler
Reserved169_IRQHandler
Reserved170_IRQHandler
PIT1_IRQHandler
PIT2_IRQHandler
ACMP1_IRQHandler
ACMP2_IRQHandler
ACMP3_IRQHandler
ACMP4_IRQHandler
Reserved177_IRQHandler
Reserved178_IRQHandler
Reserved179_IRQHandler
Reserved180_IRQHandler
ENC1_IRQHandler
ENC2_IRQHandler
ENC3_IRQHandler
ENC4_IRQHandler
Reserved185_IRQHandler
Reserved186_IRQHandler
TMR1_IRQHandler
TMR2_IRQHandler
TMR3_IRQHandler
TMR4_IRQHandler
SEMA4_CP0_IRQHandler
SEMA4_CP1_IRQHandler
PWM2_0_IRQHandler
PWM2_1_IRQHandler
PWM2_2_IRQHandler
PWM2_3_IRQHandler
PWM2_FAULT_IRQHandler
PWM3_0_IRQHandler
PWM3_1_IRQHandler
PWM3_2_IRQHandler
PWM3_3_IRQHandler
PWM3_FAULT_IRQHandler
PWM4_0_IRQHandler
PWM4_1_IRQHandler
PWM4_2_IRQHandler
PWM4_3_IRQHandler
PWM4_FAULT_IRQHandler
Reserved208_IRQHandler
Reserved209_IRQHandler
Reserved210_IRQHandler
Reserved211_IRQHandler
Reserved212_IRQHandler
Reserved213_IRQHandler
Reserved214_IRQHandler
Reserved215_IRQHandler
HWVAD_EVENT_IRQHandler
HWVAD_ERROR_IRQHandler
PDM_EVENT_IRQHandler
PDM_ERROR_IRQHandler
EMVSIM1_IRQHandler
EMVSIM2_IRQHandler
MECC1_INT_IRQHandler
MECC1_FATAL_INT_IRQHandler
MECC2_INT_IRQHandler
MECC2_FATAL_INT_IRQHandler
XECC_FLEXSPI1_INT_IRQHandler
XECC_FLEXSPI1_FATAL_INT_IRQHandler
XECC_FLEXSPI2_INT_IRQHandler
XECC_FLEXSPI2_FATAL_INT_IRQHandler
XECC_SEMC_INT_IRQHandler
XECC_SEMC_FATAL_INT_IRQHandler
Reserved232_IRQHandler
Reserved233_IRQHandler
DefaultISR
                LDR    R0, =DefaultISR
                BX     R0
                ENDP

                ALIGN


; User Initial Stack & Heap

;                IF      :DEF:__MICROLIB

;                EXPORT  __initial_sp
;                EXPORT  __heap_base
;                EXPORT  __heap_limit

;                ELSE

;                IMPORT  __use_two_region_memory
;                EXPORT  __user_initial_stackheap
;__user_initial_stackheap

;                LDR     R0, =  Heap_Mem
;                LDR     R1, =(Stack_Mem + Stack_Size)
;                LDR     R2, = (Heap_Mem +  Heap_Size)
;                LDR     R3, = Stack_Mem
;                BX      LR

;                ALIGN

;                ENDIF


                END
